[
    [
        "Saya akan menambahkan belacan pada masa yang betul untuk mengelakkan rasa yang terlalu kuat atau terlalu lemah.",
        "I will add shrimp paste at the right time to avoid a flavor that is too strong or too weak."
    ],
    [
        "Belacan memberikan rasa gurih yang khas pada hidangan.",
        "Shrimp paste adds a distinctive savory taste to the dish."
    ],
    [
        "Sambal sangat mempengaruhi cita rasa.",
        "Chilli sauce greatly influences the taste."
    ],
    [
        "Saya ingin memasak dengan sambal belacan malam ini.",
        "I want to cook with shrimp paste chilli sauce tonight."
    ],
    [
        "Roti canai dengan sambal ikan bilis, padu betul!",
        "Roti canai with chilli sauce and anchovies, really awesome!"
    ],
    [
        "Belacan yang berkualiti tinggi memberikan warna yang lebih cerah dan rasa yang lebih kaya.",
        "High-quality shrimp paste provides a brighter color and richer taste."
    ],
    [
        "Belacan yang telah dipanggang akan memberikan rasa yang lebih sedap kepada hidangan.",
        "Toasted shrimp paste will impart a tastier flavor to the dish."
    ],
    [
        "Belacan ini akan memberikan perasaan gurih yang lezat kepada hidangan Anda yang tidak dapat ditandingi oleh bahan lain.",
        "This shrimp paste will provide a delicious savory sensation to your dish that cannot be matched by other ingredients."
    ],
    [
        "Sambal init tidak pedas",
        "This chilli sauce is not spicy"
    ],
    [
        "Penggemar sambal selalu mencari yang terbaik.",
        "Chilli sauce enthusiasts always seek the best."
    ],
    [
        "Pisang goreng ini sangat enak dengan sambal.",
        "This fried banana is very tasty with chilli sauce."
    ],
    [
        "Pisang goreng ini sangat enak dengan sambal",
        "This fried banana is very tasty with chilli sauce"
    ],
    [
        "Belacan adalah salah satu bahan utama dalam pembuatan sambal.",
        "Shrimp paste is one of the main ingredients in making chilli sauce."
    ],
    [
        "Belacan adalah salah satu bahan utama dalam pembuatan sambal",
        "Shrimp paste is one of the main ingredients in making chilli sauce"
    ],
    [
        "Belacan ini merupakan pilihan yang tepat untuk menambahkan cita rasa autentik kepada hidangan Anda.",
        "This shrimp paste is the right choice to add authentic flavor to your dish."
    ],
    [
        "Sambal belacan adalah saus khas dari Malaysia.",
        "Shrimp paste chilli sauce is a typical sauce from Malaysia."
    ],
    [
        "Belacan ini telah dibuat dengan cara yang tradisional untuk memastikan keasliannya.",
        "This shrimp paste has been made in a traditional way to ensure its authenticity."
    ],
    [
        "Belacan ini akan memberikan rasa yang unik kepada hidangan ini yang tidak dapat digantikan oleh bahan lain.",
        "This shrimp paste will give a unique flavor to this dish that cannot be replaced by other ingredients."
    ],
    [
        "Rasanya yang pedas membuat sambal belacan cocok untuk hidangan laut.",
        "Its spicy taste makes shrimp paste chilli sauce suitable for seafood dishes."
    ],
    [
        "Tambahkan belacan pada saat akhir penyediaan untuk memperkayakan rasa hidangan.",
        "Add shrimp paste at the final stage of preparation to enrich the flavor of the dish."
    ],
    [
        "Sambal belacan adalah hidangan yang tidak bisa dilewatkan di rumah saya.",
        "Shrimp paste chilli sauce is a dish that cannot be missed in my house."
    ],
    [
        "Restoran itu mempunyai hidangan istimewa sambal goreng hati.",
        "That restaurant has a special dish of fried liver chilli sauce."
    ],
    [
        "Penyediaan belacan memerlukan tahap kebersihan yang tinggi.",
        "Preparing shrimp paste requires a high level of cleanliness."
    ],
    [
        "Penggunaan belacan dalam hidangan ini memberikan aroma dan rasa yang unik.",
        "The use of shrimp paste in this dish provides a unique aroma and flavor."
    ],
    [
        "Sambal belacan ini memberikan sentuhan eksotik pada hidangan.",
        "This shrimp paste chilli sauce adds an exotic touch to the dish."
    ],
    [
        "Sambal belacan ini dibuat dengan resipi keluarga saya.",
        "This shrimp paste chilli sauce is made with my family's recipe."
    ],
    [
        "Nasi lemak ayam goreng ini adalah hidangan kegemaran dengan sambal.",
        "This fried chicken nasi lemak is a favorite dish with chilli sauce."
    ],
    [
        "Nasi lemak ayam goreng ini adalah hidangan kegemaran dengan sambal",
        "This fried chicken nasi lemak is a favorite dish with chilli sauce"
    ],
    [
        "Sambal belacan ini merupakan bahan penting dalam masakan Melayu tradisional.",
        "This shrimp paste chilli sauce is an essential ingredient in traditional Malay cuisine."
    ],
    [
        "Rasa masakan itu akan lebih sedap dengan sentuhan belacan.",
        "The flavor of the dish will be more delicious with a touch of shrimp paste."
    ],
    [
        "Kami membeli belacan di pasaraya.",
        "We bought shrimp paste at the supermarket."
    ],
    [
        "Sambal belacan ini memiliki aroma yang menggugah selera.",
        "This shrimp paste chilli sauce has an appetizing aroma."
    ],
    [
        "Sambal belacan ini memberikan sentuhan pedas yang istimewa pada hidangan.",
        "This shrimp paste chilli sauce adds a special spicy touch to the dish."
    ],
    [
        "Sambal ikan goreng ini mempunyai rasa yang pedas dan nikmat.",
        "This fried fish chilli sauce has a spicy and delicious taste."
    ],
    [
        "Nasi lemak dengan sambal tempoyak ni memang mantap!",
        "Nasi lemak with fermented durian chilli sauce is really awesome!"
    ],
    [
        "Nasi goreng ini sangat enak dengan sambal.",
        "This fried rice is very delicious with chilli sauce."
    ],
    [
        "Nasi goreng ini sangat enak dengan sambal",
        "This fried rice is very delicious with chilli sauce"
    ],
    [
        "Rasakan keunikan hidangan ini dengan kehadiran belacan.",
        "Experience the uniqueness of this dish with the presence of shrimp paste."
    ],
    [
        "Anda boleh menyesuaikan kuantiti belacan mengikut kesukaan anda terhadap rasa garam.",
        "You can adjust the amount of shrimp paste according to your preference for saltiness."
    ],
    [
        "Sambal telur ini mempunyai rasa yang harum.",
        "This egg chilli sauce has a fragrant taste."
    ],
    [
        "Bilas belacan sebelum digunakan untuk mengurangkan kepekatan rasanya.",
        "Rinse shrimp paste before using to reduce its pungency."
    ],
    [
        "Adik saya tidak suka sambal belacan kerana terlalu pedas.",
        "My younger sibling doesn't like shrimp paste chilli sauce because it's too spicy."
    ],
    [
        "Tambahkan belacan untuk mencapai keseimbangan rasa yang diingini.",
        "Add shrimp paste to achieve the desired balance of flavors."
    ],
    [
        "Sambal belacan adalah kegemaran ramai di Malaysia.",
        "Shrimp paste chilli sauce is a favorite among many in Malaysia."
    ],
    [
        "Belacan menjadi bahan wajib dalam pembuatan kuah asam pedas.",
        "Shrimp paste is a mandatory ingredient in making 'kuah asam pedas'."
    ],
    [
        "Belacan dapat meningkatkan keunikan hidangan tersebut.",
        "Shrimp paste can enhance the uniqueness of the dish."
    ],
    [
        "Sambal kangkung ini sangat sedap dengan nasi panas.",
        "This water spinach chilli sauce is very tasty with hot rice."
    ],
    [
        "Masakan itu tidak lengkap tanpa perasa belacan.",
        "The dish is incomplete without the flavor of shrimp paste."
    ],
    [
        "Sambal tempe ini sangat sedap dengan nasi panas.",
        "This tempeh chilli sauce is very tasty with hot rice."
    ],
    [
        "Sambal belacan yang pedas adalah kegemaran saya.",
        "Spicy shrimp paste chilli sauce is my favorite."
    ],
    [
        "Saya akan menambahkan belacan ke dalam hidangan sayur-sayuran untuk memberikan rasa yang lebih mendalam dan gurih.",
        "I will add shrimp paste to the vegetable dish to provide a deeper and richer flavor."
    ],
    [
        "Jumlah belacan yang digunakan dalam hidangan ini bergantung pada citarasa peribadi.",
        "The amount of shrimp paste used in this dish depends on personal taste."
    ],
    [
        "Sambal ini pedas",
        "This chilli sauce is spicy"
    ],
    [
        "Sambal kerang goreng memang mengancam!",
        "Fried cockles chilli sauce is really awesome!"
    ],
    [
        "Sambal kegemaran saya adalah yang buatan sendiri.",
        "My favorite chilli sauce is homemade."
    ],
    [
        "Ayah saya beli sambal.",
        "My father buys chilli sauce."
    ],
    [
        "Ayah saya beli sambal",
        "My father buys chilli sauce"
    ],
    [
        "Ayam goreng berempah ini adalah hidangan yang istimewa dengan sambal.",
        "This spiced fried chicken is a special dish with chilli sauce."
    ],
    [
        "Ayam goreng berempah ini adalah hidangan yang istimewa dengan sambal",
        "This spiced fried chicken is a special dish with chilli sauce"
    ],
    [
        "Sambal belacan adalah hidangan tradisional Malaysia.",
        "Shrimp paste chilli sauce is a traditional Malaysian dish."
    ],
    [
        "Sambal belacan adalah rahasia kelezatan hidangan ini.",
        "Shrimp paste chilli sauce is the secret to the deliciousness of this dish."
    ],
    [
        "Saya memerlukan lebih sambal belacan untuk hidangan saya.",
        "I need more shrimp paste chilli sauce for my dish."
    ],
    [
        "Sambal cencaru ini sangat sedap dengan nasi panas.",
        "This mackerel chilli sauce is very tasty with hot rice."
    ],
    [
        "Sambal belacan ini memiliki kandungan bumbu yang pas untuk selera makanan lokal.",
        "This shrimp paste chilli sauce has the right seasoning for local tastes."
    ],
    [
        "Saya beli sambal.",
        "I buy chilli sauce."
    ],
    [
        "Saya beli sambal",
        "I buy chilli sauce"
    ],
    [
        "Nasi goreng kampung dengan sambal hijau, tak boleh lawan!",
        "Village-style fried rice with green chilli sauce, can't beat it!"
    ],
    [
        "Sambal belacan ini adalah hasil daripada resipi nenek saya.",
        "This shrimp paste chilli sauce is the result of my grandmother's recipe."
    ],
    [
        "Belacan ini bisa digunakan dalam berbagai masakan.",
        "This shrimp paste can be used in various dishes."
    ],
    [
        "Sambal belacan ini adalah rahsia kesejahteraan keluarga saya.",
        "This shrimp paste chilli sauce is the secret to my family's well-being."
    ],
    [
        "Nasi impit ini mempunyai rasa yang lazat dengan sambal.",
        "This compressed rice has a tasty flavor with chilli sauce."
    ],
    [
        "Nasi impit ini mempunyai rasa yang lazat dengan sambal",
        "This compressed rice has a tasty flavor with chilli sauce"
    ],
    [
        "Belacan yang berkualiti tinggi memberikan kesan yang berbeza dalam masakan.",
        "High-quality shrimp paste provides a different effect in dishes."
    ],
    [
        "Belacan yang terbaik dihasilkan daripada udang segar.",
        "The best shrimp paste is produced from fresh shrimp."
    ],
    [
        "Sambal belacan sangat pedas.",
        "Shrimp paste chilli sauce is very spicy."
    ],
    [
        "Sambal ikan masin ini sangat sedap dengan sambal pedas.",
        "This salted fish chilli sauce is very tasty with spicy chilli sauce."
    ],
    [
        "Belacan telah lama menjadi sebahagian penting dalam warisan masakan negara kami.",
        "Shrimp paste has long been an integral part of our culinary heritage."
    ],
    [
        "Restoran ini terkenal dengan sambalnya.",
        "This restaurant is famous for its chilli sauce."
    ],
    [
        "Sambal belacan ini sedap dimakan dengan nasi.",
        "This shrimp paste chilli sauce is delicious with rice."
    ],
    [
        "Sambal tomato ini adalah juadah yang lazat.",
        "This tomato chilli sauce is a delicious treat."
    ],
    [
        "Belacan ini dibuat dari bahan-bahan alami yang berkualitas.",
        "This shrimp paste is made from high-quality natural ingredients."
    ],
    [
        "Sambal belacan ini memiliki cita rasa yang khas.",
        "This shrimp paste chilli sauce has a distinctive flavor."
    ],
    [
        "Sambal belacan membuat makanan menjadi lebih nikmat.",
        "Shrimp paste chilli sauce makes food more delicious."
    ],
    [
        "Sambal belacan adalah bumbu rahasia dalam masakan keluarga saya.",
        "Shrimp paste chilli sauce is the secret ingredient in my family's cooking."
    ],
    [
        "Sambal dicampur dengan tomato dan bawang.",
        "Chilli sauce mixed with tomatoes and onions."
    ],
    [
        "Belacan ini akan memberikan cita rasa yang unik kepada hidangan Anda yang tidak dapat digantikan oleh bahan lain.",
        "This shrimp paste will provide a unique flavor to your dish that cannot be replaced by other ingredients."
    ],
    [
        "Belacan memberikan rasa yang unik kepada masakan.",
        "Shrimp paste gives a unique flavor to dishes."
    ],
    [
        "Sambal belacan ini adalah hasil kreasi chef terbaik.",
        "This shrimp paste chilli sauce is the result of the best chef's creation."
    ],
    [
        "Belacan perlu digoreng sehingga menjadi kering sebelum digunakan.",
        "Shrimp paste needs to be fried until dry before use."
    ],
    [
        "Nasi goreng ikan masin ini sangat enak dengan sambal.",
        "This salted fish fried rice is very tasty with chilli sauce."
    ],
    [
        "Nasi goreng ikan masin ini sangat enak dengan sambal",
        "This salted fish fried rice is very tasty with chilli sauce"
    ],
    [
        "Saya suka menggunakan belacan dalam masakan tradisional.",
        "I like to use shrimp paste in traditional cooking."
    ],
    [
        "Sambal harus disajikan dengan ikan bakar.",
        "Chilli sauce should be served with grilled fish."
    ],
    [
        "Sambal belacan ini merupakan hidangan istimewa pada majlis perkahwinan.",
        "This shrimp paste chilli sauce is a special dish at weddings."
    ],
    [
        "Belacan yang berkualiti tinggi memberikan hasil masakan yang lebih baik.",
        "High-quality shrimp paste yields better culinary results."
    ],
    [
        "Anda perlu membakar belacan sebelum menggunakannya untuk menghilangkan bau yang kuat.",
        "You need to toast the shrimp paste before using it to get rid of the strong smell."
    ],
    [
        "Mee goreng mamak ini mempunyai rasa yang sedap dengan sambal pedas.",
        "This Indian-style fried noodles have a tasty flavor with spicy chilli sauce."
    ],
    [
        "Penggunaan belacan dalam hidangan ini akan memberikan dimensi baru kepada citarasa.",
        "The use of shrimp paste in this dish will add a new dimension to the flavor."
    ],
    [
        "Saya akan menambahkan belacan ke dalam masakan ini untuk memberikan sentuhan rasa yang lazat dan berbeza.",
        "I will add shrimp paste to this dish to give it a delicious and distinctive flavor."
    ],
    [
        "Di kampung, semua orang menggunakan belacan dalam hidangan mereka.",
        "In the village, everyone uses shrimp paste in their dishes."
    ],
    [
        "Sambal belacan adalah hidangan tradisional yang sangat popular di Malaysia.",
        "Shrimp paste chilli sauce is a traditional dish that is very popular in Malaysia."
    ],
    [
        "Belacan ini telah diolah dengan teliti untuk mempertahankan kesegaran dan keasliannya.",
        "This shrimp paste has been processed carefully to maintain its freshness and authenticity."
    ],
    [
        "Sambal belacan ini adalah kegemaran saya sejak kecil lagi.",
        "This shrimp paste chilli sauce has been my favorite since childhood."
    ],
    [
        "Kebanyakkan hidangan Melayu menggunakan belacan sebagai bahan utama.",
        "Most Malay dishes use shrimp paste as a main ingredient."
    ],
    [
        "Sambal sotong ini mempunyai rasa yang unik.",
        "This squid chilli sauce has a unique taste."
    ],
    [
        "Mee goreng basah ini mempunyai rasa yang lazat dengan sambal.",
        "This wet fried noodles have a tasty flavor with chilli sauce."
    ],
    [
        "Mee goreng basah ini mempunyai rasa yang lazat dengan sambal",
        "This wet fried noodles have a tasty flavor with chilli sauce"
    ],
    [
        "Belacan tidak boleh dimakan mentah kerana boleh menyebabkan penyakit perut.",
        "Shrimp paste should not be eaten raw as it can cause stomach ailments."
    ],
    [
        "Tambahkan sedikit belacan untuk memberikan sedikit bau laut pada masakan.",
        "Add a little shrimp paste to give a hint of seafood aroma to the dish."
    ],
    [
        "Kami suka sambal",
        "We like chilli sauce"
    ],
    [
        "Pilihan belacan yang tepat memberikan hasil masakan yang memuaskan.",
        "Choosing the right shrimp paste yields satisfying culinary results."
    ],
    [
        "Sambal belacan ini adalah hidangan yang paling popular di restoran ini.",
        "This shrimp paste chilli sauce is the most popular dish at this restaurant."
    ],
    [
        "Ayam goreng ini sangat sedap dengan sambal.",
        "This fried chicken is very tasty with chilli sauce."
    ],
    [
        "Ayam goreng ini sangat sedap dengan sambal",
        "This fried chicken is very tasty with chilli sauce"
    ],
    [
        "Belacan adalah salah satu rempah penting dalam masakan Nyonya.",
        "Shrimp paste is one of the important spices in Nyonya cuisine."
    ],
    [
        "Tambahkan belacan secukup rasa mengikut kesesuaian lidah anda.",
        "Add shrimp paste to taste according to your palate."
    ],
    [
        "Sambal telur puyuh ini adalah camilan yang lazat.",
        "This quail egg chilli sauce is a delicious snack."
    ],
    [
        "Sambal nenas ini sangat enak dengan ayam goreng.",
        "This pineapple chilli sauce is very tasty with fried chicken."
    ],
    [
        "Engkau suka sambal?",
        "Do you like chilli sauce?"
    ],
    [
        "Saya akan menggunakan belacan sebagai bahan utama dalam hidangan ini untuk memaksimakan rasa dan aroma.",
        "I will use shrimp paste as the main ingredient in this dish to maximize the flavor and aroma."
    ],
    [
        "Belacan boleh dijadikan bahan utama dalam pembuatan jeruk.",
        "Shrimp paste can be used as the main ingredient in making pickles."
    ],
    [
        "Tambahkan belacan untuk menghasilkan hidangan yang lebih beraroma.",
        "Add shrimp paste to produce a more aromatic dish."
    ],
    [
        "Kerang rebus dengan sambal cili memang terbaik!",
        "Steamed cockles with chilli sauce are the best!"
    ],
    [
        "Tambahkan belacan untuk memberikan rasa gurih pada masakan itu.",
        "Add shrimp paste to give a savory taste to the dish."
    ],
    [
        "Penggunaan belacan perlu diatur dengan betul agar tidak terlalu kuat.",
        "The use of shrimp paste needs to be regulated properly to avoid it being too strong."
    ],
    [
        "Belacan adalah bumbu penting dalam hidangan Melayu.",
        "Shrimp paste is an essential seasoning in Malay dishes."
    ],
    [
        "Pulut inti ini mempunyai rasa yang sedap dengan sambal pedas.",
        "This filled glutinous rice has a tasty flavor with spicy chilli sauce."
    ],
    [
        "Sambal petai goreng tu memang sedap gila!",
        "That fried stinky bean chilli sauce is really delicious!"
    ],
    [
        "Bolehkah saya meminjam belacan dari dapur anda?",
        "Can I borrow shrimp paste from your kitchen?"
    ],
    [
        "Sambal belacan ini memberikan pengalaman rasa yang tak terlupakan.",
        "This shrimp paste chilli sauce provides an unforgettable taste experience."
    ],
    [
        "Belacan harus ditambahkan dengan penuh berhati-hati kerana rasanya sangat kuat.",
        "Shrimp paste should be added carefully as its taste is very strong."
    ],
    [
        "Nasi kerabu ini sangat sedap dengan sambal hijau.",
        "This blue rice salad is very tasty with green chilli sauce."
    ],
    [
        "Saya suka makan nasi goreng dengan sambal bajak.",
        "I like to eat fried rice with chilli sauce."
    ],
    [
        "Sambal lemak cili padi ini sangat enak dan lezat.",
        "This spicy coconut milk chilli sauce is very tasty and delicious."
    ],
    [
        "Makanan itu tidak lengkap tanpa sambal.",
        "The food is incomplete without chilli sauce."
    ],
    [
        "Makanan itu tidak lengkap tanpa sambal",
        "The food is incomplete without chilli sauce"
    ],
    [
        "Sambal belacan ini sangat pedas!",
        "This shrimp paste chilli sauce is very spicy!"
    ],
    [
        "Tambahkan belacan pada kuah untuk meningkatkan lagi rasanya.",
        "Add shrimp paste to the sauce to further enhance its flavor."
    ],
    [
        "Saya akan menumbuk belacan dengan cili untuk membuat sambal yang pedas.",
        "I will pound the shrimp paste with chilli to make spicy chilli sauce."
    ],
    [
        "Anda boleh mencuba sambal belacan kami yang baru!",
        "You can try our new shrimp paste chilli sauce!"
    ],
    [
        "Kami menggunakan belacan yang telah diproses dengan teliti untuk memastikan kualiti terbaik.",
        "We use shrimp paste that has been processed carefully to ensure the best quality."
    ],
    [
        "Kuantiti belacan yang digunakan harus disesuaikan dengan citarasa keluarga anda.",
        "The quantity of shrimp paste used should be adjusted according to your family's taste."
    ],
    [
        "Sambal belacan ini dibuat dengan bahan-bahan segar.",
        "This shrimp paste chilli sauce is made with fresh ingredients."
    ],
    [
        "Kemampuan untuk mengawal kuantiti belacan adalah kunci dalam menyediakan hidangan yang sempurna.",
        "The ability to control the quantity of shrimp paste is key in preparing the perfect dish."
    ],
    [
        "Sambal digunakan sebagai bahan utama di hidangan ini.",
        "Chilli sauce is used as the main ingredient in this dish."
    ],
    [
        "Rasa masakan itu akan lebih mendalam dengan kehadiran belacan.",
        "The flavor of the dish will be more profound with the presence of shrimp paste."
    ],
    [
        "Sambal belacan ini cocok untuk dimakan dengan nasi panas.",
        "This shrimp paste chilli sauce is suitable to eat with hot rice."
    ],
    [
        "Saya memerlukan sambal belacan untuk hidangan saya yang sedang dimasak.",
        "I need shrimp paste chilli sauce for my dish that's being cooked."
    ],
    [
        "Sambal belacan ini merupakan hidangan spesial di rumah makan ini.",
        "This shrimp paste chilli sauce is a special dish at this restaurant."
    ],
    [
        "Untuk menyediakan sambal yang sedap, anda perlu menggunakan belacan yang berkualiti tinggi.",
        "To prepare delicious chilli sauce, you need to use high-quality shrimp paste."
    ],
    [
        "Ibu menggunakan belacan untuk masakan kari.",
        "Mother uses shrimp paste for curry dishes."
    ],
    [
        "Sambal tumis ini adalah hidangan yang istimewa.",
        "This fried chilli paste is a special dish."
    ],
    [
        "Untuk hidangan yang lebih lazat, perap daging dengan sedikit gula dan belacan sebelum dimasak.",
        "For a tastier dish, marinate the meat with a bit of sugar and shrimp paste before cooking."
    ],
    [
        "Rahsia hidangan ini terletak pada kehadiran belacan yang menyeluruh.",
        "The secret of this dish lies in the presence of comprehensive shrimp paste."
    ],
    [
        "Belacan ini diperbuat daripada udang pilihan yang memberikan rasa yang kaya dan autentik kepada hidangan.",
        "This shrimp paste is made from selected prawns that give a rich and authentic flavor to the dish."
    ],
    [
        "Belacan adalah unsur penting dalam sambal tumis.",
        "Shrimp paste is an essential element in stir-fry chilli sauce."
    ],
    [
        "Ikan bakar ini mempunyai rasa yang sedap dengan sambal belacan.",
        "This grilled fish has a tasty flavor with shrimp paste chilli sauce."
    ],
    [
        "Sekiranya anda tidak suka dengan rasa belacan, anda boleh menggantikannya dengan udang kering.",
        "If you don't like the taste of shrimp paste, you can replace it with dried shrimp."
    ],
    [
        "Penyimpanan belacan dalam peti sejuk membantu mengelakkan daripada berlendir.",
        "Storing shrimp paste in the refrigerator helps prevent it from becoming slimy."
    ],
    [
        "Sambal belacan membuat hidangan menjadi lebih meriah.",
        "Shrimp paste chilli sauce makes dishes more flavorful."
    ],
    [
        "Sambal ayam goreng ini sangat sedap dan pedas.",
        "This fried chicken chilli sauce is very tasty and spicy."
    ],
    [
        "Pisang goreng coklat ini sangat sedap dengan sambal pedas.",
        "This chocolate fried banana is very tasty with spicy chilli sauce."
    ],
    [
        "Rasa pedas dan harum belacan menjadikan masakan ini istimewa.",
        "The spicy and fragrant taste of shrimp paste makes this dish special."
    ],
    [
        "Sambal belacan adalah penyedap semulajadi yang berkualiti.",
        "Shrimp paste chilli sauce is a high-quality natural flavor enhancer."
    ],
    [
        "Sambal belacan ini memberikan rasa yang kaya pada masakan.",
        "This shrimp paste chilli sauce adds a rich flavor to the dish."
    ],
    [
        "Bau belacan yang kuat boleh menyebabkan ketidakselesaan kepada sesetengah orang.",
        "The strong smell of shrimp paste can cause discomfort to some people."
    ],
    [
        "Sambal belacan ini adalah antara hidangan kegemaran saya.",
        "This shrimp paste chilli sauce is one of my favorite dishes."
    ],
    [
        "Belacan harus dijauhkan daripada kanak-kanak kerana boleh menyebabkan reaksi alergi.",
        "Shrimp paste should be kept away from children as it can cause allergic reactions."
    ],
    [
        "Kami akan menumbuk belacan dengan bawang dan cili segar untuk membuat sambal yang lazat.",
        "We will pound the shrimp paste with onions and fresh chilli to make tasty chilli sauce."
    ],
    [
        "Sambal belacan ini merupakan antara sambal belacan yang terbaik di pasaran.",
        "This shrimp paste chilli sauce is one of the best shrimp paste chilli sauces on the market."
    ],
    [
        "Kerang rebus ini sangat enak dengan sambal.",
        "These boiled clams are very tasty with chilli sauce."
    ],
    [
        "Kerang rebus ini sangat enak dengan sambal",
        "These boiled clams are very tasty with chilli sauce"
    ],
    [
        "Belacan yang digunakan harus dijamin kesegarannya.",
        "The shrimp paste used must be guaranteed for its freshness."
    ],
    [
        "Penggunaan belacan yang berlebihan boleh membuatkan hidangan terlalu pedas.",
        "Excessive use of shrimp paste can make the dish too spicy."
    ],
    [
        "Makan dengan sambal, pasti sedap!",
        "Eating with chilli sauce, surely delicious!"
    ],
    [
        "Kuantiti belacan yang digunakan mempengaruhi rasa akhir hidangan.",
        "The quantity of shrimp paste used affects the final taste of the dish."
    ],
    [
        "Belacan memperkayakan lagi rasa kuah tom yam.",
        "Shrimp paste further enriches the flavor of tom yam soup."
    ],
    [
        "Belacan merupakan salah satu bahan yang memberikan rasa utama kepada hidangan ini.",
        "Shrimp paste is one of the ingredients that provides the main flavor to this dish."
    ],
    [
        "Belacan ini telah dihasilkan dengan menggunakan bahan-bahan semula jadi berkualiti tinggi.",
        "This shrimp paste has been produced using high-quality natural ingredients."
    ],
    [
        "Pisang goreng coklat keju ini sangat enak dengan sambal pedas.",
        "This chocolate cheese fried banana is very tasty with spicy chilli sauce."
    ],
    [
        "Laksa Johor ini sangat sedap dengan sambal belacan.",
        "This Johor laksa is very tasty with shrimp paste chilli sauce."
    ],
    [
        "Adik saya tidak suka bau belacan.",
        "My younger sibling doesn't like the smell of shrimp paste."
    ],
    [
        "Sambal belacan ini dibuat dengan rahsia keluarga kami.",
        "This shrimp paste chilli sauce is made with our family's secret recipe."
    ],
    [
        "Belacan adalah bahan penting dalam banyak masakan tradisional di Malaysia.",
        "Shrimp paste is a key ingredient in many traditional Malaysian dishes."
    ],
    [
        "Sambal belacan adalah bumbu penting di dapur Malaysia.",
        "Shrimp paste chilli sauce is an important seasoning in Malaysian cuisine."
    ],
    [
        "Sambal belacan ini adalah hidangan kampung yang istimewa.",
        "This shrimp paste chilli sauce is a special village dish."
    ],
    [
        "Sambal perut lembu ini sangat sedap dan pedas.",
        "This beef tripe chilli sauce is very tasty and spicy."
    ],
    [
        "Sambal belacan ini adalah hidangan pembuka yang sempurna.",
        "This shrimp paste chilli sauce is the perfect appetizer."
    ],
    [
        "Sambal belacan ini adalah hidangan pembuka yang sempurna untuk setiap kesempatan.",
        "This shrimp paste chilli sauce is the perfect appetizer for any occasion."
    ],
    [
        "Penyediaan belacan memerlukan kesabaran dan kecekapan.",
        "Preparing shrimp paste requires patience and skill."
    ],
    [
        "Sambal itu pedas.",
        "That chilli sauce is spicy."
    ],
    [
        "Kedai makan ini terkenal dengan sambal tempoyaknya.",
        "This restaurant is famous for its fermented durian chilli sauce."
    ],
    [
        "Sambal belacan adalah hidangan favorit di restoran ini.",
        "Shrimp paste chilli sauce is a favorite dish at this restaurant."
    ],
    [
        "Sambal kacang ini pedas gila!",
        "This peanut chilli sauce is crazy spicy!"
    ],
    [
        "Kueh lapis ini adalah juadah yang lazat dengan sambal.",
        "This layered cake is a delicious treat with chilli sauce."
    ],
    [
        "Kueh lapis ini adalah juadah yang lazat dengan sambal",
        "This layered cake is a delicious treat with chilli sauce"
    ],
    [
        "Belacan asli memberikan aroma yang tidak dapat ditandingi dalam masakan.",
        "Authentic shrimp paste provides an incomparable aroma in dishes."
    ],
    [
        "Belacan ini telah dipilih dengan teliti daripada sumber yang terbaik untuk memastikan kesegarannya.",
        "This shrimp paste has been carefully selected from the best sources to ensure its freshness."
    ],
    [
        "Sambal cili hijau ini sangat enak dengan sayur kangkung.",
        "This green chilli chilli sauce is very tasty with water spinach."
    ],
    [
        "Saya suka memasak sambal belacan dengan ikan bakar.",
        "I like to cook shrimp paste chilli sauce with grilled fish."
    ],
    [
        "Kami akan menggoreng belacan sebentar sebelum menggunakannya untuk meningkatkan rasa.",
        "We will fry the shrimp paste briefly before using it to enhance the flavor."
    ],
    [
        "Kami akan tambahkan sedikit belacan pada akhir proses memasak untuk mengekalkan aroma segar.",
        "We will add a little shrimp paste at the end of the cooking process to retain the fresh aroma."
    ],
    [
        "Belacan sering digunakan dalam masakan Thai juga.",
        "Shrimp paste is also commonly used in Thai cuisine."
    ],
    [
        "Kami akan menambahkan belacan pada akhir proses memasak untuk menguatkan rasa hidangan.",
        "We will add shrimp paste at the end of the cooking process to enhance the dish's flavor."
    ],
    [
        "Sambal kicap madu ni memang sedap untuk dipadankan dengan satay.",
        "This honey soy chilli sauce is really good to pair with satay."
    ],
    [
        "Resipi rendang yang sedap memerlukan belacan yang berkualiti.",
        "A delicious rendang recipe requires high-quality shrimp paste."
    ],
    [
        "Sambal ini terlalu pedas.",
        "This chilli sauce is too spicy."
    ],
    [
        "Tambahkan sedikit belacan untuk menambahkan rasa pada sup.",
        "Add a little shrimp paste to enhance the flavor of the soup."
    ],
    [
        "Kegemaran setiap orang terhadap belacan berbeza-beza.",
        "Everyone's preference for shrimp paste varies."
    ],
    [
        "Sambal belacan yang pedas sangat cocok dengan nasi lemak.",
        "Spicy shrimp paste chilli sauce goes very well with coconut rice."
    ],
    [
        "Belacan ini memberikan rasa pedas yang istimewa pada hidangan.",
        "This shrimp paste adds a special spicy taste to the dish."
    ],
    [
        "Pilihlah belacan yang masih segar dan tidak berbau busuk.",
        "Choose shrimp paste that is still fresh and not foul-smelling."
    ],
    [
        "Belacan menjadi bahan asas dalam pembuatan pes.",
        "Shrimp paste is a fundamental ingredient in making fish paste."
    ],
    [
        "Di rumah nenek, belacan sentiasa disimpan dalam bekas kedap udara.",
        "At grandmother's house, shrimp paste is always stored in an airtight container."
    ],
    [
        "Sambal belacan ini sesuai untuk hidangan laut.",
        "This shrimp paste chilli sauce is suitable for seafood dishes."
    ],
    [
        "Sambal belacan ini mempunyai rasa yang unik.",
        "This shrimp paste chilli sauce has a unique taste."
    ],
    [
        "Belacan yang terlalu lama disimpan boleh menjadi pahit dan tidak sedap.",
        "Shrimp paste that has been stored for too long can become bitter and unpleasant."
    ],
    [
        "Belacan ini telah dihasilkan menggunakan teknik tradisional yang telah dipelihara selama berabad-abad.",
        "This shrimp paste has been produced using traditional techniques that have been preserved for centuries."
    ],
    [
        "Sambal belacan adalah bahan penting dalam masakan Asia Tenggara.",
        "Shrimp paste chilli sauce is an essential ingredient in Southeast Asian cuisine."
    ],
    [
        "Sambal belacan ini adalah rahasia kelezatan masakan keluarga kami.",
        "This shrimp paste chilli sauce is the secret to the deliciousness of our family's cooking."
    ],
    [
        "Tambahkan belacan secukup rasa mengikut citarasa anda.",
        "Add shrimp paste to taste according to your preference."
    ],
    [
        "Cuba tambah sedikit belacan ke dalam kuah untuk mendapatkan rasa yang lebih enak.",
        "Try adding a bit of shrimp paste to the gravy for a tastier flavor."
    ],
    [
        "Nasi goreng kampung ini sangat enak dengan sambal pedas.",
        "This village-style fried rice is very tasty with spicy chilli sauce."
    ],
    [
        "Saya akan menambahkan belacan ke dalam hidangan ini untuk memberikan sentuhan rasa yang khas.",
        "I will add shrimp paste to this dish to give it a distinctive flavor."
    ],
    [
        "Isteri saya menyedia sambal.",
        "My wife prepares chilli sauce."
    ],
    [
        "Isteri saya menyedia sambal",
        "My wife prepares chilli sauce"
    ],
    [
        "Penggunaan belacan yang berlebihan boleh menguasai rasa hidangan.",
        "Excessive use of shrimp paste can overpower the taste of the dish."
    ],
    [
        "Nasi lemak dengan sambal tumis bilis sangat sedap.",
        "Nasi lemak with anchovies chilli sauce is very tasty."
    ],
    [
        "Di Malaysia, sambal belacan sangat popular.",
        "In Malaysia, shrimp paste chilli sauce is very popular."
    ],
    [
        "Penambahan belacan pada awal penyediaan memberikan kesan yang lebih mendalam.",
        "Adding shrimp paste at the beginning of preparation provides a deeper effect."
    ],
    [
        "Saya akan menyediakan kuah kacang dengan menambahkan sedikit belacan untuk memberikan rasa yang lebih lezat dan kompleks.",
        "I will prepare peanut sauce by adding a little shrimp paste to give a tastier and more complex flavor."
    ],
    [
        "Rahsia masakan ini terletak pada kuantiti belacan yang digunakan.",
        "The secret of this dish lies in the quantity of shrimp paste used."
    ],
    [
        "Ikan bakar ini mempunyai rasa yang lazat dengan sambal.",
        "This grilled fish has a delicious taste with chilli sauce."
    ],
    [
        "Ikan bakar ini mempunyai rasa yang lazat dengan sambal",
        "This grilled fish has a delicious taste with chilli sauce"
    ],
    [
        "Sambal belacan ini adalah hidangan yang wajib ada di rumah saya.",
        "This shrimp paste chilli sauce is a must-have dish in my home."
    ],
    [
        "Wangi belacan yang dibakar membuatkan saya lapar.",
        "The fragrant smell of roasted shrimp paste makes me hungry."
    ],
    [
        "Belacan ini memiliki aroma yang khas dan lezat.",
        "This shrimp paste has a distinctive and delicious aroma."
    ],
    [
        "Laksam ini adalah hidangan tradisional dengan sambal.",
        "This laksam is a traditional dish with chilli sauce."
    ],
    [
        "Laksam ini adalah hidangan tradisional dengan sambal",
        "This laksam is a traditional dish with chilli sauce"
    ],
    [
        "Tambahkan belacan untuk meningkatkan cita rasa gulai itu.",
        "Add shrimp paste to enhance the flavor of the curry."
    ],
    [
        "Nasi lemak ini mempunyai sambal yang pedas.",
        "This nasi lemak has spicy chilli sauce."
    ],
    [
        "Sambal belacan dengan rasa pedas dan gurihnya sangat menggugah selera.",
        "Shrimp paste chilli sauce with its spicy and savory taste is very appetizing."
    ],
    [
        "Pulut panggang ini adalah hidangan tradisional dengan sambal.",
        "This grilled glutinous rice is a traditional dish with chilli sauce."
    ],
    [
        "Pulut panggang ini adalah hidangan tradisional dengan sambal",
        "This grilled glutinous rice is a traditional dish with chilli sauce"
    ],
    [
        "Belacan adalah bahan utama dalam rojak.",
        "Shrimp paste is the main ingredient in rojak."
    ],
    [
        "Sambal udang ini sangat enak dengan nasi hangat.",
        "This shrimp chilli sauce is very tasty with warm rice."
    ],
    [
        "Resepi asli laksa Johor memerlukan penggunaan belacan yang berkualiti.",
        "The original recipe for Johor laksa requires the use of quality shrimp paste."
    ],
    [
        "Belacan kering lebih sesuai untuk disimpan dalam jangka masa panjang.",
        "Dried shrimp paste is more suitable for long-term storage."
    ],
    [
        "Belacan merupakan bahan asas dalam beberapa masakan Melayu.",
        "Shrimp paste is a fundamental ingredient in several Malay dishes."
    ],
    [
        "Kuih bakar ini adalah hidangan yang istimewa dengan sambal.",
        "This baked cake is a special dish with chilli sauce."
    ],
    [
        "Sambal petai ini memang sedap untuk dimakan dengan ikan bakar.",
        "This stinky bean chilli sauce is really delicious to eat with grilled fish."
    ],
    [
        "Sambal belacan memberikan rasa gurih yang khas.",
        "Shrimp paste chilli sauce gives a distinctive savory taste."
    ],
    [
        "John suka makan mee dengan sambal.",
        "John likes to eat noodle with chilli sauce."
    ],
    [
        "Di Malaysia, sambal belacan sering digunakan dalam masakan.",
        "In Malaysia, shrimp paste chilli sauce is often used in cooking."
    ],
    [
        "Sambal belacan ini mempunyai tekstur yang halus.",
        "This shrimp paste chilli sauce has a smooth texture."
    ],
    [
        "Sup tulang ini adalah juadah yang istimewa dengan sambal pedas.",
        "This bone soup is a special treat with spicy chilli sauce."
    ],
    [
        "Tambahkan belacan secukup rasa untuk mengimbangi rasa masin dan masam dalam hidangan.",
        "Add shrimp paste to taste to balance the salty and sour flavors in the dish."
    ],
    [
        "Sambal ayam ini adalah camilan yang lazat dengan sambal.",
        "This chicken chilli sauce is a delicious snack with chilli sauce."
    ],
    [
        "Sambal belacan adalah saus yang membuat makanan lebih meriah.",
        "Shrimp paste chilli sauce is a sauce that makes food more flavorful."
    ],
    [
        "Sambal belacan ini dibuat dengan bahan-bahan alami dan berkualitas tinggi.",
        "This shrimp paste chilli sauce is made with natural and high-quality ingredients."
    ],
    [
        "Sambal belacan ini memberikan rasa pedas dan gurih yang lezat.",
        "This shrimp paste chilli sauce provides a delicious spicy and savory taste."
    ],
    [
        "Belacan ini memiliki tekstur yang halus dan lembut.",
        "This shrimp paste has a smooth and soft texture."
    ],
    [
        "Kami akan menambahkan belacan sedikit demi sedikit semasa memasak untuk mencapai rasa yang diinginkan.",
        "I will add shrimp paste little by little while cooking to achieve the desired taste."
    ],
    [
        "Saya memerlukan sambal belacan untuk hidangan malam ini.",
        "I need shrimp paste chilli sauce for tonight's dish."
    ],
    [
        "Sambal belacan adalah salah satu hidangan kegemaran saya di Malaysia.",
        "Shrimp paste chilli sauce is one of my favorite dishes in Malaysia."
    ],
    [
        "Ibu membuat sambal dengan pedas.",
        "Mother makes chilli sauce spicy."
    ],
    [
        "Sambal belacan sangat cocok dengan ikan bakar.",
        "Shrimp paste chilli sauce goes well with grilled fish."
    ],
    [
        "Restoran ini terkenal dengan hidangan sambal belacan mereka.",
        "This restaurant is famous for their shrimp paste chilli sauce dish."
    ],
    [
        "Sambal belacan ini adalah hidangan terbaik di kedai ini.",
        "This shrimp paste chilli sauce is the best dish at this shop."
    ],
    [
        "Ayam goreng berlada dengan tambahan belacan adalah hidangan kegemaran saya.",
        "Spicy fried chicken with added shrimp paste is my favorite dish."
    ],
    [
        "Sambal belacan ini akan menambah selera makan anda.",
        "This shrimp paste chilli sauce will enhance your appetite."
    ],
    [
        "Belacan telah digunakan dalam masakan Asia Tenggara sejak berabad-abad yang lalu.",
        "Shrimp paste has been used in Southeast Asian cuisine for centuries."
    ],
    [
        "Sambal belacan ini adalah hidangan pembuka yang lazat.",
        "This shrimp paste chilli sauce is a delicious appetizer."
    ],
    [
        "Apa resepi sambal yang paling sedap?",
        "What's the recipe for the most delicious chilli sauce?"
    ],
    [
        "Sambal belacan merupakan bagian penting dari hidangan lokal.",
        "Shrimp paste chilli sauce is an important part of local cuisine."
    ],
    [
        "Roti bakar ini sangat enak dengan sambal.",
        "This toast bread is very tasty with chilli sauce."
    ],
    [
        "Sambal belacan ini adalah bahan penting dalam hidangan Malaysia.",
        "This shrimp paste chilli sauce is an essential ingredient in Malaysian dishes."
    ],
    [
        "Sotong goreng ini adalah hidangan kegemaran dengan sambal.",
        "This fried squid is a favorite dish with chilli sauce."
    ],
    [
        "Mee goreng mamak basah ini mempunyai rasa yang lazat dengan sambal.",
        "This wet Indian-style fried noodles have a tasty flavor with chilli sauce."
    ],
    [
        "Kegemaran terhadap belacan bergantung kepada selera masing-masing.",
        "Preference for shrimp paste depends on individual taste."
    ],
    [
        "Tambahkan sedikit belacan untuk menguatkan lagi rasa asam masakan itu.",
        "Add a little shrimp paste to further enhance the sour taste of the dish."
    ],
    [
        "Sambal belacan ini memberikan rasa yang unik pada hidangan.",
        "This shrimp paste chilli sauce adds a unique flavor to the dish."
    ],
    [
        "Sambal belacan ini sangat pas untuk dimakan dengan nasi.",
        "This shrimp paste chilli sauce is perfect to eat with rice."
    ],
    [
        "Belacan digunakan sebagai perasa dalam pembuatan sambal.",
        "Shrimp paste is used as a seasoning in making chilli sauce."
    ],
    [
        "Belacan harus disimpan dalam bekas kedap udara untuk mengelakkan daripada berbau.",
        "Shrimp paste should be stored in an airtight container to prevent it from smelling."
    ],
    [
        "Aku suka makan sup tulang dengan sambal.",
        "I like to eat bone soup with chilli sauce."
    ],
    [
        "Ibu memasukkan belacan ke dalam kuah sup untuk memberikan rasa yang kaya.",
        "Mother adds shrimp paste to the soup broth to give it a rich flavor."
    ],
    [
        "Belacan ini telah diimport dari negara asalnya untuk memastikan keasliannya dan kualitinya yang terbaik.",
        "This shrimp paste has been imported from its country of origin to ensure its authenticity and best quality."
    ],
    [
        "Ikan bakar ni pedas, ada sambal?",
        "This grilled fish is spicy, with chilli sauce?"
    ],
    [
        "Kami menggunakan sambal belacan dalam hidangan kami.",
        "We use shrimp paste chilli sauce in our dishes."
    ],
    [
        "Rendang ayam ini sangat enak dengan sambal.",
        "This chicken rendang is very delicious with chilli sauce."
    ],
    [
        "Sambal belacan merupakan hidangan yang sangat populer di Malaysia.",
        "Shrimp paste chilli sauce is a very popular dish in Malaysia."
    ],
    [
        "Belacan ini dapat meningkatkan selera makan Anda.",
        "This shrimp paste can enhance your appetite."
    ],
    [
        "Belacan adalah bumbu rahasia dalam masakan keluarga saya.",
        "Shrimp paste is the secret seasoning in my family's cooking."
    ],
    [
        "Rendang ini pedas, tambah sambal?",
        "This rendang is spicy, add chilli sauce?"
    ],
    [
        "Sambal yang pedas itu enak.",
        "The spicy chilli sauce is delicious."
    ],
    [
        "Sambal belacan dengan rasa pedasnya sangat lezat.",
        "Shrimp paste chilli sauce with its spicy flavor is very tasty."
    ],
    [
        "Penghasilan belacan memerlukan masa yang agak lama.",
        "Producing shrimp paste requires a rather long time."
    ],
    [
        "Sambal jering ini mempunyai rasa yang pedas.",
        "This bitter bean chilli sauce has a spicy taste."
    ],
    [
        "Saya suka menambahkan sedikit sambal belacan ke dalam sup sayur saya.",
        "I like to add a little shrimp paste chilli sauce to my vegetable soup."
    ],
    [
        "Hidangan ini tidak akan lengkap tanpa tambahan sedikit belacan untuk memperkaya rasa.",
        "This dish would not be complete without a little addition of shrimp paste to enrich the flavor."
    ],
    [
        "Sambal belacan pedas sangat!",
        "The shrimp paste chilli sauce is very spicy!"
    ],
    [
        "Rasa masakan itu menjadi lebih kompleks dengan penambahan belacan.",
        "The flavor of the dish becomes more complex with the addition of shrimp paste."
    ],
    [
        "Sambal tumis cili padi dia memang sedap!",
        "His stir-fried bird's eye chilli sauce is really delicious!"
    ],
    [
        "Anda harus mencuba sambal belacan di restoran ini.",
        "You should try the shrimp paste chilli sauce at this restaurant."
    ],
    [
        "Belacan boleh disimpan dalam peti sejuk untuk mengekalkan kesegarannya.",
        "Shrimp paste can be stored in the refrigerator to maintain its freshness."
    ],
    [
        "Sambal belacan ini adalah bahan penting dalam masakan Melayu.",
        "This shrimp paste chilli sauce is an essential ingredient in Malay cuisine."
    ],
    [
        "Belacan ini memberikan sentuhan khas pada hidangan.",
        "This shrimp paste adds a distinctive touch to the dish."
    ],
    [
        "Sambal belacan ini membuat makanan menjadi lebih beraroma.",
        "This shrimp paste chilli sauce makes food more aromatic."
    ],
    [
        "Belacan yang disimpan dengan betul akan kekal segar untuk tempoh yang lebih lama.",
        "Properly stored shrimp paste will remain fresh for a longer period."
    ],
    [
        "Tambahkan belacan untuk menambahkan lagi lapisan rasa pada masakan itu.",
        "Add shrimp paste to add another layer of flavor to the dish."
    ],
    [
        "Ibu menggunakan belacan untuk menambah rasa dalam masakan.",
        "Mother uses shrimp paste to enhance the flavor in cooking."
    ],
    [
        "Sayur campur ini adalah juadah yang istimewa dengan sambal.",
        "This mixed vegetables dish is a special treat with chilli sauce."
    ],
    [
        "Sayur campur ini adalah juadah yang istimewa dengan sambal",
        "This mixed vegetables dish is a special treat with chilli sauce"
    ],
   [
        "Belacan ini terkenal dengan rasa yang kuat dan pekat, menjadikannya pilihan utama dalam hidangan tradisional.",
        "This shrimp paste is known for its strong and intense flavor, making it a primary choice in traditional dishes."
    ],
    [
        "Bolehkah anda tolong saya mencari belacan di pasaraya?",
        "Can you help me find shrimp paste at the supermarket?"
    ],
    [
        "Sup daging ini mempunyai rasa yang lazat dengan sambal.",
        "This beef soup has a tasty flavor with chilli sauce."
    ],
    [
        "Penggunaan belacan dalam jumlah yang tepat memberikan kesan yang memuaskan.",
        "The proper use of shrimp paste in the right quantity yields satisfying results."
    ],
    [
        "Sambal nenas ini adalah hidangan yang istimewa.",
        "This pineapple chilli sauce is a special dish."
    ],
    [
        "Puding roti ini adalah hidangan yang istimewa dengan sambal.",
        "This bread pudding is a special dish with chilli sauce."
    ],
    [
        "Saya akan menambahkan sedikit belacan ke dalam sup untuk memberikan rasa yang lebih enak dan lazat.",
        "I will add a little shrimp paste to the soup to give a tastier and more delicious flavor."
    ],
    [
        "Adik saya sangat suka masakan yang mengandungi belacan.",
        "My younger sibling really likes dishes that contain shrimp paste."
    ],
    [
        "Hidangan ini memerlukan belacan sebagai bahan utama untuk mencapai cita rasa yang autentik.",
        "This dish requires shrimp paste as a main ingredient to achieve an authentic flavor."
    ],
    [
        "Kandungan protein dalam belacan memberikan nilai nutrisi yang baik.",
        "The protein content in shrimp paste provides good nutritional value."
    ],
    [
        "Belacan adalah bahan rahsia dalam hidangan udang goreng.",
        "Shrimp paste is the secret ingredient in fried shrimp dishes."
    ],
    [
        "Belacan segar mempunyai aroma yang lebih tajam daripada yang sudah diproses.",
        "Fresh shrimp paste has a sharper aroma than processed ones."
    ],
    [
        "Sambal cili api dari Kelantan memang power!",
        "The bird's eye chilli sauce from Kelantan is really powerful!"
    ],
    [
        "Sambal belacan ini perlu dimakan dengan hati-hati kerana pedas.",
        "This shrimp paste chilli sauce needs to be eaten carefully because it's spicy."
    ],
    [
        "Sambal ikan masin ini mempunyai kuah yang kaya.",
        "This salted fish chilli sauce has a rich gravy."
    ],
    [
        "Belacan yang dibeli dari pasar malam biasanya lebih segar daripada yang dijual di pasaraya.",
        "Shrimp paste bought from the night market is usually fresher than those sold in supermarkets."
    ],
    [
        "Belacan adalah salah satu bahan utama dalam sambal.",
        "Shrimp paste is one of the main ingredients in chilli sauce."
    ],
    [
        "Belacan adalah salah satu bahan utama dalam sambal",
        "Shrimp paste is one of the main ingredients in chilli sauce"
    ],
    [
        "Perisa belacan amat penting dalam hidangan tradisional.",
        "The flavor of shrimp paste is crucial in traditional dishes."
    ],
    [
        "Belacan yang digunakan perlu dipastikan tidak mengandungi bahan tambahan yang merbahaya.",
        "The shrimp paste used must be ensured not to contain harmful additives."
    ],
    [
        "Sambal belacan adalah pilihan yang tepat untuk hidangan laut.",
        "Shrimp paste chilli sauce is the right choice for seafood dishes."
    ],
    [
        "Sambal belacan membangkitkan selera makan.",
        "Shrimp paste chilli sauce whets the appetite."
    ],
    [
        "Sambal belacan ini memberikan sentuhan khas pada masakan.",
        "This shrimp paste chilli sauce adds a distinctive touch to the dish."
    ],
    [
        "Saya suka menambahkan sambal belacan ke dalam sup.",
        "I like to add shrimp paste chilli sauce to soup."
    ],
    [
        "Anda boleh mencuba belacan ini terlebih dahulu untuk menentukan tahap kepedasan yang sesuai.",
        "You can try this shrimp paste first to determine the appropriate level of spiciness."
    ],
    [
        "Resepi ini tidak akan lengkap tanpa kehadiran belacan yang memberikan rasa yang khas.",
        "This recipe would not be complete without the presence of shrimp paste that gives a distinctive flavor."
    ],
    [
        "Rasa masakan ini tidak lengkap tanpa belacan.",
        "The flavor of this dish is incomplete without shrimp paste."
    ],
    [
        "Belacan digunakan sebagai penyedap dalam masakan.",
        "Shrimp paste is used as a flavor enhancer in cooking."
    ],
    [
        "Satay ayam ini sangat sedap dengan sambal kacang.",
        "This chicken satay is very tasty with peanut chilli sauce."
    ],
    [
        "Sambal belacan ini sangat enak!",
        "This shrimp paste chilli sauce is very tasty!"
    ],
    [
        "Sambal belacan ini memiliki aroma yang harum dan rasanya yang unik.",
        "This shrimp paste chilli sauce has a fragrant aroma and a unique taste."
    ],
    [
        "Sambal belacan ini adalah hasil daripada resipi warisan nenek saya.",
        "This shrimp paste chilli sauce is the result of my grandmother's heritage recipe."
    ],
    [
        "Bahan-bahan utama dalam hidangan ini termasuk cili, bawang, dan belacan.",
        "The main ingredients in this dish include chilli, onions, and shrimp paste."
    ],
    [
        "Jangan lupa letak belacan untuk menambah cita rasa mee goreng.",
        "Don't forget to add shrimp paste to enhance the flavor of fried noodles."
    ],
    [
        "Sambal belacan yang saya buat amat pedas!",
        "The shrimp paste chilli sauce I made is very spicy!"
    ],
    [
        "Saya suka menggunakan sambal belacan dalam masakan saya.",
        "I like to use shrimp paste chilli sauce in my cooking."
    ],
    [
        "Adik saya lebih suka sambal belacan yang tidak pedas.",
        "My younger sibling prefers shrimp paste chilli sauce that is not spicy."
    ],
    [
        "Belacan menjadi bahan utama dalam kuah laksa.",
        "Shrimp paste is the main ingredient in laksa broth."
    ],
    [
        "Di beberapa kawasan, belacan diperdagangkan dalam bentuk blok.",
        "In some areas, shrimp paste is traded in block form."
    ],
    [
        "Belacan memainkan peranan penting dalam pembuatan acar.",
        "Shrimp paste plays a crucial role in making pickles."
    ],
    [
        "Penggunaan belacan tidak digalakkan bagi individu yang alah terhadap makanan laut.",
        "The use of shrimp paste is not encouraged for individuals allergic to seafood."
    ],
    [
        "Ahmad suka sambal.",
        "Ahmad likes chilli sauce."
    ],
    [
        "Penggunaan belacan secara berlebihan boleh mengganggu keseimbangan rasa hidangan.",
        "Excessive use of shrimp paste can disrupt the balance of flavors in the dish."
    ],
    [
        "Sambal belacan ini adalah pembuka selera yang baik.",
        "This shrimp paste chilli sauce is a good appetizer."
    ],
    [
        "Sambal belacan adalah favorit di restoran ini.",
        "Shrimp paste chilli sauce is a favorite at this restaurant."
    ]
]